html/docker/kubernates/persistency.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>持久化</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">持久化</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org75386f7">目录共享</a></li>
<li><a href="#orgaaa9439">持久化卷</a></li>
</ul>
</div>
</div>
<pre class="example">
  卷可以让容器之外的存储挂在到容器中的某个目录上，使得删除容器后修改不会丢失
</pre>

<div id="outline-container-org75386f7" class="outline-2">
<h2 id="org75386f7">目录共享</h2>
<div class="outline-text-2" id="text-org75386f7">
<p>
<span class="underline">EmptyDir</span> 使得多容器的pod可以很方便的共享读写某个目录/文件：
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4eee94;">apiVersion</span>: v1
<span style="color: #4eee94;">kind</span>: Pod
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #4eee94;">name</span>: volume-pod
<span style="color: #4eee94;">spec</span>:
  <span style="color: #4eee94;">containers</span>:
  - <span style="color: #4eee94;">image</span>: busybox
    <span style="color: #4eee94;">name</span>: busybox
    <span style="color: #4eee94;">command</span>: [<span style="color: #deb887;">"/bin/sh"</span>, <span style="color: #deb887;">"-c"</span>, <span style="color: #deb887;">"while true; do sleep 3600; done"</span>]
    <span style="color: #4eee94;">volumeMounts</span>:
    - <span style="color: #4eee94;">mountPath</span>: /tmp/storage
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #4eee94;">  name</span>: my-volume
  <span style="color: #4eee94;">volumes</span>:
  - <span style="color: #4eee94;">name</span>: my-volume
    <span style="color: #4eee94;">emptyDir</span>: {}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaaa9439" class="outline-2">
<h2 id="orgaaa9439">持久化卷</h2>
<div class="outline-text-2" id="text-orgaaa9439">
<p>
Persistent Volume是对存储的抽象，这个抽象包含两个资源：
</p>
<ul class="org-ul">
<li>持久化卷： PersistentVolume，简称PV， 是集群中的一块网络存储，也是Kubernetes集群的一种资源</li>
<li>持久卷申请：PersistentVolumeClaim，简称PVC，是用户对PV资源的申请，例如申请特定的访问模式和大小</li>
</ul>

<pre class="example">
 Pod的Volume与PV的区别是：

Volume的生命周期和Pod相同，Pod被删除时，Volume和保存在Volume中的数据就被删除了

对于PV，即使挂载PV的Pod被删除了，PV仍然存在，PV上的数据也还在
</pre>

<p>
PV定义文件：
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4eee94;">kind</span>: PersistentVolume
<span style="color: #4eee94;">apiVersion</span>: v1
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #4eee94;">name</span>: my-pv
<span style="color: #4eee94;">spec</span>:
  <span style="color: #4eee94;">storageClassName</span>: local-storage
  <span style="color: #4eee94;">capacity</span>:
    <span style="color: #4eee94;">storage</span>: 1Gi
  <span style="color: #4eee94;">accessModes</span>:
    - ReadWriteOnce
  <span style="color: #4eee94;">hostPath</span>:
    <span style="color: #4eee94;">path</span>: <span style="color: #deb887;">"/mnt/data"</span>
</pre>
</div>

<p>
PVC定义文件：
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4eee94;">apiVersion</span>: v1
<span style="color: #4eee94;">kind</span>: PersistentVolumeClaim
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #4eee94;">name</span>: my-pvc
<span style="color: #4eee94;">spec</span>:
  <span style="color: #4eee94;">storageClassName</span>: local-storage
  <span style="color: #4eee94;">accessModes</span>:
    - ReadWriteOnce
  <span style="color: #4eee94;">resources</span>:
    <span style="color: #4eee94;">requests</span>:
       <span style="color: #4eee94;">storage</span>: 512Mi
</pre>
</div>

<pre class="example">
1. PVC中的storageClassName 和 accessModes 必须和PV中的相同
2. PVC的容量必须小于PV的容量
</pre>

<p>
查询PV和PVC：
</p>
<div class="org-src-container">
<pre class="src src-sh">kubectl get pv
kubectl get pvc
</pre>
</div>

<p>
在Pod定义文件中使用创建好的PVC：
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #4eee94;">kind</span>: Pod
<span style="color: #4eee94;">apiVersion</span>: v1
<span style="color: #4eee94;">metadata</span>:
  <span style="color: #4eee94;">name</span>: my-pvc-pod
<span style="color: #4eee94;">spec</span>:
  <span style="color: #4eee94;">containers</span>:
  - <span style="color: #4eee94;">name</span>: busybox
    <span style="color: #4eee94;">image</span>: busybox
    <span style="color: #4eee94;">command</span>: [<span style="color: #deb887;">"/bin/sh"</span>, <span style="color: #deb887;">"-c"</span>, <span style="color: #deb887;">"while true; do sleep 3600; done"</span>]
    <span style="color: #4eee94;">volumeMounts</span>:
    - <span style="color: #4eee94;">mountPath</span>: <span style="color: #deb887;">"/mnt/storage"</span>
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #4eee94;">   name</span>: my-storage
  <span style="color: #4eee94;">volumes</span>:
  - <span style="color: #4eee94;">name</span>: my-storage
    <span style="color: #4eee94;">persistentVolumeClaim</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #4eee94;">  claimName</span>: my-pvc
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
